# Задача 1. Создайте список. Запишите в него N первых элементов последовательности Фибоначчи.
# 6 –> 1 1 2 3 5 8
def Task1():
    print("Задача 1")
    number = abs(int(input("Введите число N: ")))
    if number > 1:
        fib_sequence = [1, 1]
        for _ in range(2, number):
            fib_sequence.append(fib_sequence[-1] + fib_sequence[-2])
    else:
        fib_sequence = [1]
    print(*fib_sequence)

# Задача 2. В списке находятся названия фруктов. Выведите все фрукты, названия которых начинаются на заданную букву.
# а –> абрикос, авокадо, апельсин, айва.
def Task2():
    print("\nЗадача 2")
    fruits = [
    "абрикос", "авокадо", "арбуз", "апельсин", "айва", "ананас",
    "банан", "барбарис", "боярышник",
    "груша", "гранат", "гуава",
    "дыня",
    "ежевика",
    "жимолость",
    "земляника",
    "изюм",
    "каламондин", "киви", "красноплодная рябина",
    "лайм", "лимон", "личи",
    "мандарин", "манго", "малина",
    "нектарин",
    "облепиха",
    "папайя", "персик", "помело",
    "рамбутан",
    "слива", "смородина",
    "тамарилло", "тыква",
    "фейхоа", "финик", "физалис",
    "хурма",
    "цитрон",
    "черешня", "черная смородина", "чайот",
    "шелковица", "шиповник",
    "яблоко",]
    letter = input("Введите букву: ").lower()[0]
    for i in fruits:
        if i[0] == letter:
            print(i)

#Task1()
#Task2()